In [1]:
# import libraries
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [13]:
pip install mysql-connector-python

Collecting mysql-connector-pythonNote: you may need to restart the kernel to use updated packages.

  Downloading mysql_connector_python-8.0.31-cp37-cp37m-win_amd64.whl (7.9 MB)
     ---------------------------------------- 7.9/7.9 MB 490.1 kB/s eta 0:00:00
Requirement already satisfied: protobuf<=3.20.1,>=3.11.0 in c:\users\nabin adhikari\appdata\local\programs\python\python37\lib\site-packages (from mysql-connector-python) (3.20.1)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.31

[notice] A new release of pip available: 22.3 -> 22.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [16]:
pip install --upgrade pip

Requirement already satisfied: pip in c:\users\nabin adhikari\appdata\local\programs\python\python37\lib\site-packages (22.3)
Collecting pip
  Downloading pip-22.3.1-py3-none-any.whl (2.1 MB)
     ---------------------------------------- 2.1/2.1 MB 68.2 kB/s eta 0:00:00
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 22.3
    Uninstalling pip-22.3:
      Successfully uninstalled pip-22.3
Successfully installed pip-22.3.1
Note: you may need to restart the kernel to use updated packages.

In [2]:
def create_server_connection(host_name,user_name,user_password):
    connection=None
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
        password = user_password)
        print('MySQL Database connection successful')
    except Error as err:
        print(f"Error: '{err}'")
    return connection
#put our MySQL terminal password
pw = "SQLdatascience"
#Database name
db = "mysql_python"
connection = create_server_connection("localhost","root",pw)

MySQL Database connection successful

In [3]:
#create Database mysql_python
def create_database(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")
create_database_query = "Create database mysql_python"
create_database(connection,create_database_query)

Error: '1007 (HY000): Can't create database 'mysql_python'; database exists'

In [4]:
#connect to database
def create_db_connection(host_name,user_name,user_password,db_name):
    connection = None
    try:
        connection  = mysql.connector.connect(
        host = host_name,
        user = user_name,
        password = user_password,
        database = db_name)
        print('MySQL database connection successfully')
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [5]:
#Execute sql queries
def execute_query(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print('Query was successful')
    except Error as err:
        print(f"Error:'{err}'")

In [6]:
create_orders_table = '''
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));'''

# connec to the database
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,create_orders_table)

MySQL database connection successfully
Error:'1050 (42S01): Table 'orders' already exists'

In [7]:
#insert data
data_orders = '''
insert into orders values
(101,'Nabin','Laptop','2018-06-12',2,800,'9841748595'),
(102,'Jobs','Books','2019-02-10',10,12,'9841748590'),
(103,'Stacy','Trousers','2019-12-25',5,50,'9841748591'),
(104,'Nancy','T-shirts','2018-07-14',2,800,'9841748592'),
(105,'Maria','Headphones','2019-05-30',6,48,'9841748593'),
(106,'Danny','Smart TV','2018-08-20',10,300,'9841748594');'''

connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,data_orders)

MySQL database connection successfully
Error:'1062 (23000): Duplicate entry '101' for key 'orders.PRIMARY''

In [8]:
def read_query(connection,query):
    cursor = connection.cursor()
    result =None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [9]:
#using the select statement
q1 = '''
select * from orders;
'''
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q1)
for result in results:
    print(result)

MySQL database connection successfully
(101, 'Nabin', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '9841748595')
(102, 'Jobs', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '9841748590')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '9841748591')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 2, 800.0, '9841748592')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '9841748593')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '9841748594')

In [10]:
#using the select statement
q2 = '''
select customer_name,phone_number from orders;
'''
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q2)
for result in results:
    print(result)

MySQL database connection successfully
('Nabin', '9841748595')
('Jobs', '9841748590')
('Stacy', '9841748591')
('Nancy', '9841748592')
('Maria', '9841748593')
('Danny', '9841748594')

In [11]:
#using the select statement
q3 = '''
select year(date_ordered) from orders;
'''
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q3)
for result in results:
    print(result)

MySQL database connection successfully
(2018,)
(2019,)
(2019,)
(2018,)
(2019,)
(2018,)

In [12]:
#using the select statement
q3 = '''
select day(date_ordered) from orders;
'''
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q3)
for result in results:
    print(result)

MySQL database connection successfully
(12,)
(10,)
(25,)
(14,)
(30,)
(20,)

In [13]:
#using the select statement
q4 = '''
select distinct year(date_ordered) from orders;
'''
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q4)
for result in results:
    print(result)

MySQL database connection successfully
(2018,)
(2019,)

In [14]:
#using the select statement
q5 = '''
select * from orders where date_ordered < '2018-12-31';
'''
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q5)
for result in results:
    print(result)

MySQL database connection successfully
(101, 'Nabin', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '9841748595')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 2, 800.0, '9841748592')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '9841748594')

In [15]:
#using the select statement
q7 = '''
select * from orders order by unit_price desc;
'''
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q7)
for result in results:
    print(result)

MySQL database connection successfully
(101, 'Nabin', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '9841748595')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 2, 800.0, '9841748592')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '9841748594')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '9841748591')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '9841748593')
(102, 'Jobs', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '9841748590')

In [17]:
from_db = []
for result in results:
    result = list(result)
    from_db.append(result)
columns = ["order_id","customer_name","product_name","date_ordered","quantity","unit_price","phone_number"] 
df = pd.DataFrame(from_db,columns = columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Nabin,Laptop,2018-06-12,2,800.0,9841748595
1,104,Nancy,T-shirts,2018-07-14,2,800.0,9841748592
2,106,Danny,Smart TV,2018-08-20,10,300.0,9841748594
3,103,Stacy,Trousers,2019-12-25,5,50.0,9841748591
4,105,Maria,Headphones,2019-05-30,6,48.0,9841748593
5,102,Jobs,Books,2019-02-10,10,12.0,9841748590

In [18]:
#update command
update = '''
update orders 
set unit_price = 45
where order_id=103
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update)

MySQL database connection successfully
Query was successful

In [19]:
q8 = '''
select * from orders where order_id=103;
'''
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q8)
for result in results:
    print(result)

MySQL database connection successfully
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '9841748591')

In [20]:
#Delete command
delete_order = '''
delete from orders
where order_id=105;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,delete_order)

MySQL database connection successfully
Query was successful

In [21]:
q9 = '''
select * from orders;
'''
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q9)
for result in results:
    print(result)

MySQL database connection successfully
(101, 'Nabin', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '9841748595')
(102, 'Jobs', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '9841748590')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '9841748591')
(104, 'Nancy', 'T-shirts', datetime.date(2018, 7, 14), 2, 800.0, '9841748592')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '9841748594')